app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", "3"]]
---
		 				   <span class="glyphicon glyphicon-heart text-danger" aria-hidden="true"></span></i>
							<%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", "4"]]
---
							   <span class="glyphicon glyphicon-heart text-white" aria-hidden="true"></span>
							<%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", "3"]]
---
					<!-- いいね　end -->
					<td><%= book.post_comments.count %>件</td>