app/views/books/show.html.erb

							    <span class="glyphicon glyphicon-heart text-danger" aria-hidden="true"></span>
							<%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", "3"]]

							    <span class="glyphicon glyphicon-heart text-white" aria-hidden="true"></span>
							<%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", "3"]]