app/controllers/books_controller.rb

  def index
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hogebook"], ["body", "hogebook"], ["user_id", 7], ["created_at", "2020-08-05 04:02:29.740885"], ["updated_at", "2020-08-05 04:02:29.740885"]]