app/controllers/post_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?, ?)  [["comment", "hohohohoho"], ["user_id", 4], ["created_at", "2020-08-03 13:17:12.260834"], ["updated_at", "2020-08-03 13:17:12.260834"], ["book_id", "3"]]
---
  def create
    book = Book.find(params[:book_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.book_id = book.id
    comment.save