app/controllers/searches_controller.rb

  def search
    @range = params[:range]
    search = params[:search]
    @word = params[:word]

    if @range == '1'
      @user = User.search(search,@word)
    else
      @book = Book.search(search,@word)
---
SELECT "users".* FROM "users" WHERE (text LIKE'foofoo%')
SELECT "books".* FROM "books" WHERE (text LIKE'hogebook%')